import { useTranslation } from 'next-i18next';
import { Container } from '@/components/screens/landing/Container';
import { Title } from '@/components/screens/landing/Title';
import { GreenText } from '@/components/screens/landing/GreenText';
import { Text } from '@/components/screens/landing/Text';
import FaqItem from '@/components/screens/FaqItem/FaqItem';
import styles from './faq.module.css';

function Faq() {
  const { t } = useTranslation();
  return (
    <Container>
      <div className={styles.faq}>
        <Title className={styles.title}>
          Часто задаваемые <GreenText>вопросы</GreenText>
        </Title>
        <div className={styles.faq__wrap}>
          <FaqItem title="Это законно?">
            В июне 2021 года в королевстве Таиланд произошла полная легализация
            производства, хранения и употребления каннабиса. Наша компания Green
            Grow Pharmaceuticals официально зарегистрирована в Таиланде как
            юридическое лицо. Мы обладаем всеми необходимыми лицензиями и платим
            налоги в полном объеме. Инвестирование в производство каннабиса на
            территории других государств не преследуется по закону в РФ. Акции
            крупнейших каннабис-производящих компаний можно официально купить на
            российских и зарубежных рынках.
          </FaqItem>
          <FaqItem title="Это законно?">
            В июне 2021 года в королевстве Таиланд произошла полная легализация
            производства, хранения и употребления каннабиса. Наша компания Green
            Grow Pharmaceuticals официально зарегистрирована в Таиланде как
            юридическое лицо. Мы обладаем всеми необходимыми лицензиями и платим
            налоги в полном объеме. Инвестирование в производство каннабиса на
            территории других государств не преследуется по закону в РФ. Акции
            крупнейших каннабис-производящих компаний можно официально купить на
            российских и зарубежных рынках.
          </FaqItem>
          <FaqItem title="Это законно?">
            В июне 2021 года в королевстве Таиланд произошла полная легализация
            производства, хранения и употребления каннабиса. Наша компания Green
            Grow Pharmaceuticals официально зарегистрирована в Таиланде как
            юридическое лицо. Мы обладаем всеми необходимыми лицензиями и платим
            налоги в полном объеме. Инвестирование в производство каннабиса на
            территории других государств не преследуется по закону в РФ. Акции
            крупнейших каннабис-производящих компаний можно официально купить на
            российских и зарубежных рынках.
          </FaqItem>
          <FaqItem title="Это законно?">
            В июне 2021 года в королевстве Таиланд произошла полная легализация
            производства, хранения и употребления каннабиса. Наша компания Green
            Grow Pharmaceuticals официально зарегистрирована в Таиланде как
            юридическое лицо. Мы обладаем всеми необходимыми лицензиями и платим
            налоги в полном объеме. Инвестирование в производство каннабиса на
            территории других государств не преследуется по закону в РФ. Акции
            крупнейших каннабис-производящих компаний можно официально купить на
            российских и зарубежных рынках.
          </FaqItem>
          <FaqItem title="Это законно?">
            В июне 2021 года в королевстве Таиланд произошла полная легализация
            производства, хранения и употребления каннабиса. Наша компания Green
            Grow Pharmaceuticals официально зарегистрирована в Таиланде как
            юридическое лицо. Мы обладаем всеми необходимыми лицензиями и платим
            налоги в полном объеме. Инвестирование в производство каннабиса на
            территории других государств не преследуется по закону в РФ. Акции
            крупнейших каннабис-производящих компаний можно официально купить на
            российских и зарубежных рынках.
          </FaqItem>
          <FaqItem title="Это законно?">
            В июне 2021 года в королевстве Таиланд произошла полная легализация
            производства, хранения и употребления каннабиса. Наша компания Green
            Grow Pharmaceuticals официально зарегистрирована в Таиланде как
            юридическое лицо. Мы обладаем всеми необходимыми лицензиями и платим
            налоги в полном объеме. Инвестирование в производство каннабиса на
            территории других государств не преследуется по закону в РФ. Акции
            крупнейших каннабис-производящих компаний можно официально купить на
            российских и зарубежных рынках.
          </FaqItem>
          <FaqItem title="Это законно?">
            В июне 2021 года в королевстве Таиланд произошла полная легализация
            производства, хранения и употребления каннабиса. Наша компания Green
            Grow Pharmaceuticals официально зарегистрирована в Таиланде как
            юридическое лицо. Мы обладаем всеми необходимыми лицензиями и платим
            налоги в полном объеме. Инвестирование в производство каннабиса на
            территории других государств не преследуется по закону в РФ. Акции
            крупнейших каннабис-производящих компаний можно официально купить на
            российских и зарубежных рынках.
          </FaqItem>
          <FaqItem title="Это законно?">
            В июне 2021 года в королевстве Таиланд произошла полная легализация
            производства, хранения и употребления каннабиса. Наша компания Green
            Grow Pharmaceuticals официально зарегистрирована в Таиланде как
            юридическое лицо. Мы обладаем всеми необходимыми лицензиями и платим
            налоги в полном объеме. Инвестирование в производство каннабиса на
            территории других государств не преследуется по закону в РФ. Акции
            крупнейших каннабис-производящих компаний можно официально купить на
            российских и зарубежных рынках.
          </FaqItem>
          <FaqItem title="Это законно?">
            В июне 2021 года в королевстве Таиланд произошла полная легализация
            производства, хранения и употребления каннабиса. Наша компания Green
            Grow Pharmaceuticals официально зарегистрирована в Таиланде как
            юридическое лицо. Мы обладаем всеми необходимыми лицензиями и платим
            налоги в полном объеме. Инвестирование в производство каннабиса на
            территории других государств не преследуется по закону в РФ. Акции
            крупнейших каннабис-производящих компаний можно официально купить на
            российских и зарубежных рынках.
          </FaqItem>
        </div>
      </div>
    </Container>
  );
}

export default Faq;
